irentex/app/controllers/category_items_controller.rb

SELECT "car_cats".* FROM "car_cats" WHERE (1 = 1 AND Price between '%10%' AND '%1300%' AND Name LIKE '%%')
SELECT "category_filters".* FROM "category_filters" WHERE (category_id LIKE '%1%' order by id ASC)
---
def show


     if $searchRes == 2



    @items = $itemsS
	@filters = $filtersS
	@ColourArr = $ColourArray
	@minPrice = $minPriceS
	@maxPrice = $maxPriceS
	@CheckBoxesArray = $CheckBoxesArray

	$searchRes = 0


	  else


	$searchCatId = params[:iid]




	@items = Item.findwithcategory(params[:iid])
    @filters = 	CategoryFilter.findByCat(params[:iid])

SELECT "category_filters".* FROM "category_filters" WHERE (category_id LIKE '%1%')
---
def searchCat

   #Message.where(user_id: Profile.select("user_id").where(gender: 'm'))

	#$ColourArray.each do |c|
		#puts params["Color_"+c]
	#end
	#@arr = CarCat.order(:id)
	#$count = countOfArray(CarCat.order(:id))

	    filterArr = CategoryFilter.findByCat($searchCatId)