irentex/app/controllers/items_controller.rb

	def index
	  @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", nil]]

def new
	@user = User.find(params[:user_id])
  @filters =  CategoryFilter.findByCat(@user.categories_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "category_filters".* FROM "category_filters" WHERE (category_id LIKE '%1%')

def create
  @user = User.find(params[:user_id])
 	@item = @user.items.create(item_params)
  @filters =  CategoryFilter.findByCat(@user.categories_id)


  if @item.save
        params[:item_attachments]['image'].each do |a|
                  @item_attachment = @item.item_attachments.create!(:image => a)
        end

        @filters.each do |fi|
            @itemSpecs = ItemSpec.create( :item_id => @item.id, :category_filter_id => fi.id, :value => params[fi.nameOfLabel]  )
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "items" ("item_name", "item_desc", "item_price", "category_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item_name", "2"], ["item_desc", "2"], ["item_price", 2.0], ["category_id", 1], ["user_id", 1], ["created_at", "2017-04-19 15:00:11.515052"], ["updated_at", "2017-04-19 15:00:11.515052"]]
SELECT "category_filters".* FROM "category_filters" WHERE (category_id LIKE '%1%')
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
INSERT INTO "item_attachments" ("image", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "#<ActionDispatch::Http::UploadedFile:0x007ff34e6fcc70>"], ["item_id", 7], ["created_at", "2017-04-03 08:04:07.649753"], ["updated_at", "2017-04-03 08:04:07.649753"]]
INSERT INTO "item_specs" ("item_id", "category_filter_id", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 11], ["category_filter_id", 1], ["value", "33"], ["created_at", "2017-04-21 07:23:15.806718"], ["updated_at", "2017-04-21 07:23:15.806718"]]

def edit
  @item = Item.find(params[:id])
  @itemSpecs = ItemSpec.findbyItem(@item.id)
    @user = User.find(params[:user_id])
  @filters =  CategoryFilter.findByCat(@user.categories_id)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 7]]
SELECT "item_specs".* FROM "item_specs" WHERE (item_id = '2')
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "category_filters".* FROM "category_filters" WHERE (category_id = '2')

def update
  @user = User.find(params[:user_id])
  @item = Item.find(params[:id])

  @filters =  CategoryFilter.findByCat(@user.categories_id)
  @itemSpecs = ItemSpec.findbyItem(@item.id)

  if @item.update(item_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 7]]
SELECT "category_filters".* FROM "category_filters" WHERE (category_id = '2')
SELECT "item_specs".* FROM "item_specs" WHERE (item_id = '2')
UPDATE "item_specs" SET "value" = ?, "updated_at" = ? WHERE "item_specs"."id" = ?  [["value", "yes"], ["updated_at", "2017-04-21 12:24:35.405744"], ["id", 7]]
UPDATE "items" SET "item_name" = ?, "item_desc" = ?, "item_price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["item_name", "ay kalam"], ["item_desc", "9ier"], ["item_price", 399.0], ["updated_at", "2017-03-26 16:31:41.391101"], ["id", 7]]

def destroy
  @user = User.find(params[:user_id])
  @item = Item.find(params[:id])

  @itemSpecs = ItemSpec.findbyItem(@item.id)

  @itemSpecs.each do |is|
              is.destroy
          end
  @item.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "item_specs".* FROM "item_specs" WHERE "item_specs"."id" = ? LIMIT 1  [["id", 25]]
DELETE FROM "item_specs" WHERE "item_specs"."id" = ?  [["id", 25]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 7]]