irentex/app/controllers/item_attachments_controller.rb

SELECT "item_attachments".* FROM "item_attachments"
---
  def index
    @item_attachments = ItemAttachment.all

UPDATE "item_attachments" SET "image" = ?, "updated_at" = ? WHERE "item_attachments"."id" = ?  [["image", "ir_4-3.png"], ["updated_at", "2017-04-03 10:03:33.747255"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @item_attachment.update(item_attachment_params)

DELETE FROM "item_attachments" WHERE "item_attachments"."id" = ?  [["id", 1]]
---
  def destroy
    @item_attachment.destroy

SELECT  "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_item_attachment
      @item_attachment = ItemAttachment.find(params[:id])