irentex/app/controllers/rentps_controller.rb

SELECT  "rentps".* FROM "rentps" WHERE "rentps"."id" = ? LIMIT 1  [["id", nil]]
---
def index
	  @rentp = Rentp.find(params[:id])

SELECT  "rentps".* FROM "rentps" WHERE "rentps"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
---
def show
	  @rentp = Rentp.find(params[:id])
	  @item  = @rentp.items.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "rentps" ("rp_address", "rp_gover", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rp_address", "89585"], ["rp_gover", "Beni Suef"], ["user_id", 1], ["created_at", "2017-03-22 20:02:44.808883"], ["updated_at", "2017-03-22 20:02:44.808883"]]
---
def create
	@user = User.find(params[:user_id])
	@user.rentps.create(rentp_params)