irentex/app/controllers/rentp_normals_controller.rb

SELECT  "rentps".* FROM "rentps" WHERE "rentps"."id" = ? LIMIT 1  [["id", nil]]
SELECT "items".* FROM "items" WHERE "items"."rentp_id" = ?  [["rentp_id", 1]]
SELECT "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = ?  [["item_id", 9]]
---
	def show
		  @rentp = Rentp.find(params[:id])
		  @items  = @rentp.items.all
		  @item_attachments = []
		  @items.each do |i|
		  	 	@item_attachments << i.item_attachments.all.fetch(0)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 9]]
SELECT  "rentps".* FROM "rentps" WHERE "rentps"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def index
		@item  = Item.find(params[:iid])
		@rentp = Rentp.find(@item.rentp_id)
		@owner = User.find(@rentp.user_id)