irentex/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."usr_email" = ? LIMIT 1  [["usr_email", "magdy.youmna@gmail.com"]]
---
  def create
    user = User.find_by(usr_email: params[:session][:email].downcase)