irentex/app/controllers/users_controller.rb

	def index
	  @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]

	def show
	  @user = User.find(params[:id])
	  @items = Item.findwithuser(params[:id])

	  @user_category = Category.find(@user.categories_id)
	  @filters =  CategoryFilter.findByCat(@user.categories_id)

	  labels =  []
	  itemspecs_all = []

	  flag = 0
	  @items.each do |i|
	  		@itemSpecs = ItemSpec.findbyItem(i.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "items".* FROM "items" WHERE (user_id LIKE '%1%')
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "category_filters".* FROM "category_filters" WHERE "category_filters"."id" = ? LIMIT 1  [["id", 1]]
SELECT "item_specs".* FROM "item_specs" WHERE (item_id LIKE '%1%')

	def uploadlogo
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "users" SET "usr_logo" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["usr_logo", "14224848_696251990527190_1629550074611477477_n.jpg"], ["updated_at", "2017-04-20 09:35:17.478981"], ["id", 4]]

	def create
		@categories = Category.all
	 	@user = User.new(user_params)
	  	if @user.save
---
SELECT "categories".* FROM "categories"
INSERT INTO "users" ("usr_fname", "usr_email", "usr_tel", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["usr_fname", "Mah"], ["usr_email", "magdy"], ["usr_tel", "9309"], ["created_at", "2017-03-15 16:05:02.945171"], ["updated_at", "2017-03-15 16:05:02.945171"]]

	 def edit
	  @user = User.find(params[:id])
	  @categories = Category.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
SELECT "categories".* FROM "categories"

	def update
		@user = User.find(params[:id])
		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "users" SET "usr_description" = ?, "usr_gover" = ?, "usr_delivery" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["usr_description", "we allow wedding dresses renting"], ["usr_gover", "Alexandria"], ["usr_delivery", 0], ["updated_at", "2017-04-20 12:11:18.011974"], ["id", 4]]