irentex/app/views/rentps/show.html.erb

  </tr>
<% @rentp.items.each do |i| %>
---
SELECT "items".* FROM "items" WHERE "items"."rentp_id" = ?  [[nil, 3]]

      <table>
        <% i.item_attachments.all.each do |p| %>
---
SELECT "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = ?  [["item_id", 1]]