irentex/app/views/users/show.html.erb

      <table>
        <% i.item_attachments.all.each do |p| %>
---
SELECT "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = ?  [["item_id", 1]]
SELECT "items".* FROM "items" WHERE (user_id LIKE '%1%')