irentex/app/views/rentp_normals/index.html.erb


  <% @item.item_attachments.all.each do |p| %>
---
SELECT "item_attachments".* FROM "item_attachments" WHERE "item_attachments"."item_id" = ?  [["item_id", 9]]